// TASK 3 коробова.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>


using namespace std;



int main()
{
    setlocale(0, ""); //вывод русских символов на консоль
    cout << "Программа показывающая простые числа до введенного нами числа \n"; //вывод условия задачи на экран
    cout << "Если хотите запустить программу, нажмите 1, иначе, любую другую клавишу\n";
    char menu = 0;
    cin >> menu;
    while (menu == '1')
    {
        {
            cout << "Введите простое число\n";
            int n;
            cout << "n= ";
            cin >> n;
            int* a = new int[n + 1];
            for (int i = 0; i < n + 1; i++)
                a[i] = i;
            for (int p = 2; p < n + 1; p++)
            {
                if (a[p] != 0)
                {
                    cout << a[p] << endl;
                    for (int j = p * p; j < n + 1; j += p)
                        a[j] = 0;
                }
            }
            cin.get(); cin.get();
        }
        cout << "Если хотите запустить программу, нажмите 1, иначе, любую другую клавишу\n";
        cin >> menu;
        if (menu != '1') break;
    }
}